app/views/posts/edit.html.erb


            <% @post.categories.each do |post_category| %>
---
SELECT `categories`.* FROM `categories` INNER JOIN `categories_posts` ON `categories`.`id` = `categories_posts`.`category_id` WHERE `categories_posts`.`post_id` = 4