app/views/posts/show.html.erb


  <% @post.categories.each do |c| %>
---
SELECT `categories`.* FROM `categories` INNER JOIN `categories_posts` ON `categories`.`id` = `categories_posts`.`category_id` WHERE `categories_posts`.`post_id` = 4

  <table>
    <% @post.tags.each do |t| %>
---
SELECT `tags`.* FROM `tags`  WHERE `tags`.`post_id` = 4