app/controllers/categories_controller.rb

SELECT  `categories`.* FROM `categories`  LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `categories`
---
  def index
    @categories = Category.paginate(page: params[:page], per_page: 5)

INSERT INTO `categories` (`created_at`, `description`, `updated_at`) VALUES ('2014-12-20 15:02:52', 'Ubuntu', '2014-12-20 15:02:52')
---
  def create
    @category = Category.new(category_params)
    @category.save

UPDATE `categories` SET `description` = '.NETt', `updated_at` = '2014-12-20 15:17:44' WHERE `categories`.`id` = 2
---
  def update
    @category.update(category_params)