app/controllers/posts_controller.rb

SELECT  `posts`.* FROM `posts`   ORDER BY `posts`.`created_at` ASC LIMIT 5
SELECT COUNT(*) FROM `posts`
---
  def index
    @posts = Post.paginate(page: params[:page], per_page: 5)

UPDATE `posts` SET `clicks` = 1, `updated_at` = '2014-12-22 13:33:48' WHERE `posts`.`id` = 10
---
  def show
    @post.clicks += 1
    @post.save!

SELECT `categories`.* FROM `categories`   ORDER BY `categories`.`description` ASC
---
  def new
    @categories = Category.order :description

SELECT `categories`.* FROM `categories`   ORDER BY `categories`.`description` ASC
---
  def edit
    @categories =  Category.order :description

INSERT INTO `posts` (`created_at`, `post_text`, `slug`, `title`, `updated_at`, `user_id`) VALUES ('2014-12-21 21:24:23', '<p>dgadgadgadgadg</p>', 'adgadgadg', 'adgadgadg', '2014-12-21 21:24:23', 1)
---
  def create
    @post = Post.new(post_params)
    @post.save

SELECT  `posts`.* FROM `posts`  WHERE `posts`.`id` = 9 LIMIT 1
---
    def set_post
      @post = Post.friendly.find(params[:id])