app/controllers/tags_controller.rb

SELECT  `tags`.* FROM `tags`  WHERE `tags`.`id` = 8 LIMIT 1
SELECT DISTINCT `tags`.* FROM `tags`  WHERE `tags`.`tag` = 'adgadgadg'
SELECT `posts`.* FROM `posts`  WHERE `posts`.`id` IN (10, 12)
---
  def show
  	@tag = Tag.find params[:id]
  	@posts = Tag.where(tag: @tag.tag).includes(:post)