app/controllers/tinymce_assets_controller.rb

  def create
    geometry = Paperclip::Geometry.from_file params[:file]
    image    = Image.create params.permit(:file, :alt, :hint)
---
INSERT INTO `images` (`created_at`, `file_content_type`, `file_file_name`, `file_file_size`, `file_updated_at`, `updated_at`) VALUES ('2014-12-21 20:08:24', 'image/png', 'Screenshot_from_2014-12-11_10_59_12.png', 80417, '2014-12-21 20:08:24', '2014-12-21 20:08:24')