app/views/categories/_list_posts.html.erb

SELECT `posts`.* FROM `posts` INNER JOIN `categories_posts` ON `posts`.`id` = `categories_posts`.`post_id` WHERE `categories_posts`.`category_id` = 17
---
	<tbody>
		<% @category.posts.each do |post| %>